src/mocks/checkout_failed_event.json

{
  "id": "evt_1Lh6ZCKdTNhAxbgQIRpvPOAC",
  "object": "event",
  "api_version": "2022-08-01",
  "created": 1662965786,
  "data": {
    "object": {
      "id": "cs_test_a1n6XR4GqGhM79820fl70cerSyZlGXWnn0sRk84PaWIDvomZtsh6UFPk2d",
      "object": "checkout.session",
      "after_expiration": null,
      "allow_promotion_codes": null,
      "amount_subtotal": 2440000,
      "amount_total": 2440000,
      "automatic_tax": {
        "enabled": false,
        "status": null
      },
      "billing_address_collection": null,
      "cancel_url": "https://localhost:3000/booking/failed",
      "client_reference_id": null,
      "consent": null,
      "consent_collection": null,
      "currency": "usd",
      "customer": null,
      "customer_creation": "if_required",
      "customer_details": null,
      "customer_email": null,
      "expires_at": 1662965786,
      "livemode": false,
      "locale": null,
      "metadata": {
        "bookingId": "4ec3de38-8532-4abc-95d6-9c43c13f6df0"
      },
      "mode": "payment",
      "payment_intent": null,
      "payment_link": null,
      "payment_method_collection": "always",
      "payment_method_options": {
      },
      "payment_method_types": [
        "card"
      ],
      "payment_status": "unpaid",
      "phone_number_collection": {
        "enabled": false
      },
      "recovered_from": null,
      "setup_intent": null,
      "shipping_address_collection": null,
      "shipping_cost": null,
      "shipping_details": null,
      "shipping_options": [
      ],
      "status": "expired",
      "submit_type": null,
      "subscription": null,
      "success_url": "https://localhost:3000/booking/4ec3de38-8532-4abc-95d6-9c43c13f6df0/success",
      "total_details": {
        "amount_discount": 0,
        "amount_shipping": 0,
        "amount_tax": 0
      },
      "url": null
    }
  },
  "livemode": false,
  "pending_webhooks": 1,
  "request": {
    "id": null,
    "idempotency_key": null
  },
  "type": "checkout.session.expired"
}